<?php

$pageTitle = 'Страница входа на сайт';

include_once $_SERVER['DOCUMENT_ROOT'] . '/content/templates/page_header.php';
?>

<p>Все веб-страницы, которые отображаются в браузере, являются текстом HTML. HTML - язык текстовой разметки, не является языком программирования и не может выполнять команды. HTML отвечает за содержание веб-страницы: текст, ссылки, рисунки и т.п.</p>
    <p>Для оформления выводимой веб-страницы в требуемом формате используется язык CSS. CSS - каскадные таблицы стилей. CSS отвечает за фон станицы, за используемые шрифты, за выравнивание элементов на странице и т.п.</p>

    <?php
    echo 'Hello<br>';
    echo $contentData;
    ?>



<?php
include_once $_SERVER['DOCUMENT_ROOT'] . '/content/templates/page_footer.php';
